{
    "questions": [
        {
            "value": "Вызов метода класса без создания экземпляра <p>В PHP есть возможность вызвать метод класса, без создания экземпляра, например, <code>UsefulClass::useful_method($argument)</code> вместо <code>$instance"
        },
        {
            "value": "Можно ли подключить DLL в python? <p>Если можно то желательно пример</p>"
        },
        {
            "value": "Декораторы для методов класса <p>В django есть замечательные штуки - generic.views, которые позволяют в несколько строк вывести список моделей, создавать и редактировать. Но, к сожалению, к ним не при"
        },
        {
            "value": "Скачивание файла через urllib <p>Подскажите, пожалуйста, как скачать файл средствами python (urllib) доступный по http и положить его рядом со скриптом?</p>"
        },
        {
            "value": "django. view. параметры <p>Есть страница с кучей полей (пусть это будут обычные input)</p>\n<p>[...]</p>\n<pre><code>input name=\"names[0]\" value=\"1\"\ninput name=\"names[1]\" value=\"2\"\ninput name=\"names[2]\""
        },
        {
            "value": "Поиск ближайших объектов в списке <p>В общем, у меня есть файл со строками вида:</p>\n<pre><code>ADG,AIRPORT,USA,49221,,MI,,Madison,Adrian,,W Cadmus Rd,-84.07275,41.87428,Lenawee County Airport,\n\nADS,A"
        },
        {
            "value": "Поправить в regex <p>Ребята, поправьте, пожалуйста, регулярное выражение ip address, может можно красившее написать.</p>\n<pre><code>p = '^10.0.11|12|15|21|25|31|35|40|41|45.(?:25[0-5]|2[0-4][0-9]|[01]"
        },
        {
            "value": "Вызов скрипта с ключом -h или -help <p>Обыскал весь интернет, посмотрел в 2 книжках(одни магические слова), никак не могу понять как вызвать скрипт с этими ключами...Подскажите пожалуйста...</p>"
        },
        {
            "value": "Работа с нестандартными символами букв в re <p>Мне нужно работать с разными языками при парсинге строк регекспами. Я использую в регекспах \"\\w\", но в итоге под этот регексп подходят только латинские с"
        },
        {
            "value": "Передача аргументов функции из функции <p>Не знаю правильно ли сформулировал вопрос, но все же...\nУ меня есть функция, в которой опредяется 4 переменные путем ввода пользователем,\n    find(lat, lon, p"
        },
        {
            "value": "Как перевести строку в bytes в Python 3.2? Как перевести строку в bytes в Python 3.2?"
        },
        {
            "value": "Получение значений из другой функции <p>У меня есть функция </p>\n<pre><code>def opr(obj, s):\n   obj = raw_input('Enter %s: ' % (s))\n   ....обработка obj....\n</code></pre>\n<p>ей передаются аргументы из"
        },
        {
            "value": "Ограничение ввода чисел float <p>У меня есть переменная, которую вводит пользователь:</p>\n<pre><code>obj = raw_input('Enter %s: ' % (s))\n</code></pre>\n<p>она вводится в формате float, как мне ограничи"
        },
        {
            "value": "Проблема с использованием cx_Freeze <p>Вообщем нужно было скомпилировать питон программку в исполняемый файл, но у меня почему-то не получается! И я заметил, что не запускается программка, только если"
        },
        {
            "value": "Не хочет импортироваться модуль random в cx_Freeze <p>Решил недавно скоимпилировать .py программу в исполняемый файл, и столкнулся с одной проблемой. Сначала скомпилированная прога просто не запускала"
        },
        {
            "value": "Запуск Python приложения на Windows у которого нет python интерпретатора <p>Как запускать python приложения на windows , учитывая что на этом ПК нет интерпретатора ?</p>"
        },
        {
            "value": "Считать пары значений в словарь <p>Добрый день, помогите, пожалуйста, с такой задачей, есть файл, где есть данные ввиде:</p>\n<pre><code>а 00000\nz 00001\ns 000100\ng 000101\n</code></pre>\n<p>Сейчас я отту"
        },
        {
            "value": "Шифрование с открытым ключом <p>Мне надо осуществить обмен данными между двумя информационными-системами. Данные хочу передавать в зашифрованном виде. Слышал о том, что возможно шифрование по ключу, т"
        },
        {
            "value": "Описание \"дерева\" Oracle в Django models.py <p>Доброго времени суток. Помогите, пожалуйста, со следующим вопросом.</p>\n<p>Необходимо описать модель дерева в Django. Используемая БД - Oracle.</p>\n<p>Оп"
        },
        {
            "value": "Как узнать количество аргументов, передающихся функции? <p>Например, у меня есть код</p>\n<pre><code>def one(x, y = 0, z = 0):\n   two(x, y, z)\ndef two(x, y):\n    print x, y\n</code></pre>\n<p>Мне надо уз"
        },
        {
            "value": "Обработка ошибок, функция <p>Добрый день! Помогите, пожалуйста, разобраться, у меня есть функция:</p>\n<pre><code>def bin(n):\nif n == 0:\n    return []\nn, d = divmod(n, 2)\nreturn bin(n) + [d]\n</code></p"
        },
        {
            "value": "Кастомизация связи \"многие ко многим\" <p>Есть 2 модели. Одна модель описывает товар, другая описывает опции. Любая из моделей может иметь любые из опций. Следовательно это поле Многие-ко-Многим. Но ес"
        },
        {
            "value": "Иногда вываливается ошибка table crashed. Что это значит? <p>Иногда происходит такой фейл. Причем он происходит рандомно и разово, после перезагрузки страницы все ок... Что это вообще может значить? И"
        },
        {
            "value": "Как преобразовать массив бит в строку? <p>У меня есть строка из не печатных символов. Мне надо ее передать на сервер. Проблема в том, что в \"сыром\" виде стоку не передашь (в ней могут быть спец символ"
        },
        {
            "value": "Вывод через пробел Python <p>Ума не приложу, как правильно вывести массив типа integer в виде строки через пробел? Есть варианты? Массив вида:</p>\n<pre><code>z = [1,2,3,4,5,6,7]\n</code></pre>"
        },
        {
            "value": "RSS криво отображается в разных браузерах (Django) <p>По нижеописсаной проблеме выяснилось что подобное только на последних версиях браузелов Хром и Лисы. В IE как ни странно все отображается корректн"
        },
        {
            "value": "Передача параметров функции <p>Добрый день!</p>\n<p>В коде скрипта есть переменные:</p>\n<pre><code>HOST   = '127.0.0.1'\nDBASE  = 'disp'\nUSER   = 'cpps'\nPASS   = '123'\n</code></pre>\n<p>Как я могу переда"
        },
        {
            "value": "socket - broken pipe. Переполнение стека. Как лечить? <p>Вот ошибка:</p>\n<blockquote>\n<p><code>File \"library.zip/xmpp/transports.py\", line 183, in send\n    self._send(raw_data)\n  File \"/usr/lib/python"
        },
        {
            "value": "Задачи для python <p>Изучая питон, столкнулся с проблемой. Мне некуда использовать полученные знания и поэтому прошу вас позадавать мне хорошие задачи по питону (допросы гугла не помогли).</p>"
        },
        {
            "value": "Ресурсы по Python и Perl <p>Существуют сайты или книги с заданиями/упражнениями по языкам Python и Perl? Если знаете такие ресурсы, то дайте ссылки. Мне необходимо практиковаться по данным языкам. Спа"
        },
        {
            "value": "Вызов других python скриптов <p>Нужно, чтобы один скрипт вызывал другой, как это сделать? Скрипты лежат в одной папке.\nНет, в один файл слить нельзя заранее.</p>"
        },
        {
            "value": "Python. Сделать замену с помощью sub <p>Здравствуйте.<br>\nКак красиво и лучше сделать замену с помощью sub (мб и не sub?)?<br>\nЕсть группы и в тексте надо заменить группы кортежом (22, 33, 'krasivo'),"
        },
        {
            "value": "Ruby, Python  - чем так хороши? <p>Недавно встечался со с одним директором агенства по сайтам, тот мне сказал учи Питона и Руби, за сайты на этих технологиях в 3 раза больше платят, чем php проггерам,"
        },
        {
            "value": "Try на python3 <pre><code>import sys\n\ndef throws():\n    raise RuntimeError('this is the error message')\n\ndef main():\n    try:\n        throws()\n        return 0\n    except Exception, err:\n        sys.s"
        },
        {
            "value": "Автоматическое заполнение формы в Django Template <p>Добрый день.</p>\n<p>Есть форма пользовательского профиля.\nПри выводе на экран ее надо заполнить данными текущего пользователя.\nКак это можно сделат"
        },
        {
            "value": "Python, посоветуйте литературу <p>Посоветуйте хорошую литературу по Питону, направленную на создание Веб-приложений. И посоветуйте среду разработки в которой стоит работать, или там без компиляции? И "
        },
        {
            "value": "Ошибка: функция засчитывает только первый знак <p>Здравствуйте! </p>\n<p>Делаю программу на Питоне, которая считает количество определенных знаков препинания в тексте. Столкнулся с проблемой: функция з"
        },
        {
            "value": "Сортировка с условием <p>Как мне сделать такую штуку. Есть класс активности, есть класс занятия (урок). У каждой активности есть тип и дата. Количество типов конечно и мало. Мне надо отсортировать объ"
        },
        {
            "value": "Как сделать запись в файл? <p>Как мне можно сделать запись в файл и потом считывание? </p>\n<p>Допустим, в файле есть строка 1 \"Password\" . При запуске программа запрашивает пароль и при вводе того, чт"
        },
        {
            "value": "Реализация представления в Django ORM <p>Здравствуйте.\nКак можно реализовать вьюху (представление в mysql) в Django ORM.\nНапример, есть класс Группы, нам надо вытащить студентов (группы:'студенты', 'п"
        },
        {
            "value": "Подскажите модуль графики, чтоб был на весь экран? <p>Подскажите, может есть такой простой графический модуль для питона, чтоб был на весь экран. Чтобы задавать картинку, линию, кружок?</p>"
        },
        {
            "value": "Создание профиля пользователя одновременно с самим пользователем <p>Добрый день!</p>\n<p>У меня есть модель, описывающая профиль пользователя:</p>\n<pre><code>class Profile(models.Model):\n    user = mod"
        },
        {
            "value": "Python и работа с другими устройствами и комьютерами с помощью PYRO <p>Кто-нибудь работа с помощью библиотеки PYRO в Python с удалёнными объектами или например, с уладённым компьютером на Linux, или с"
        },
        {
            "value": "Как перемешать список, сохранив индексы? <p>Есть массив и его сохранённая копия. Над массивом делаются некоторые преобразования, затем он перемешивается, например с помощью <code>numpy.random.shuffle("
        },
        {
            "value": "Преобразование кодировок строк из Web-формы <p>Добрый день!</p>\n<p>Помогите решить проблемку с кодировками. Имеем Python 3.2, на котором написан скрипт обрабатывающий данные, полученные из формы. Данн"
        },
        {
            "value": "Как симулировать нажатие клавиш и передвижение мыши? <p>Вроде можно через модуль win32api, а вот как? Есть ли гайды по этому поводу?</p>"
        },
        {
            "value": "Выбор схемы БД при подключении (или выборе данных) в cx_Oracle <p>Доброго времени суток.</p>\n<p>Есть необходимость выбрать схему БД при коннекте (или же при выборе данных) к БД Oracle. Но вот где в па"
        },
        {
            "value": "Python, удаление элемента из массива <pre><code>i=0\nlst=d\nfor i in range(dl):\n    f=d[i]\n    print f\n    if fnmatch.fnmatch(f,mask):\n        print \"ff\"\n    else:\n        print \"file is not be reader\"\n"
        },
        {
            "value": "Senior Python Developer? <p>Часто вижу в заголовках вакансии слово Senior, и далее большие суммы которые готовы платить этому человеку. Закономерно возникает вопрос, кто такой Senior?<br>\nКакие критер"
        },
        {
            "value": "Как определить выбранный элемент из списка в Tkinter.ListBox? <p>При выборе элемента из списка <code>Listbox (lis) - lis.bind(\"Button-1&gt;\",choose)</code> выполняется процедура </p>\n<pre><code> def c"
        },
        {
            "value": "Будущие перспективы программирования? <p>Здравствуйте, уважаемые. </p>\n<p>Дело в том, что находясь на 2 курсе Информационных технологий наступает такая пора, когда надо выбирать дальнейшее направление"
        },
        {
            "value": "Установка wxPython сборкой из исходников, что нужно указать в prefix <p>В моей сборке linux папка c python находится в</p>\n<pre><code>/usr/lib\n</code></pre>\n<p>Я скачал: wxPython-src-2.8.8.0.tar.bz2 р"
        },
        {
            "value": "Сохранить и вернуть сохраненные значения <p>Есть метод <code>save()</code>, который сохраняет экземпляр, если метод <code>get()</code>, который возвращает значения, а есть ли метод, чтобы сохранил и в"
        },
        {
            "value": "Как удалить пунктуацию из строки Юникода? <p>Например, есть строка на японском, китайском, русском и вообще каком-нибудь языке. Я пытаюсь удалить оттуда все символы пунктуации, заменив их пробелами пр"
        },
        {
            "value": "Импорт в python <p>Доброго времени суток. Я только начинаю знакомиться с Python и столкнулся с проблемой подгрузки собственного конфига.</p>\n<p><strong>index.py:</strong></p>\n<pre><code>if os.path.exi"
        },
        {
            "value": "Как установить libsamplerate для питона? Как установить libsamplerate для питона?"
        },
        {
            "value": "Парсинг ISO образа на Python <p>Как прочитать iso-образ из программы (простите за опечатку) на python?</p>\n"
        },
        {
            "value": "Как удалить элемент массива в зависимости от последнего символа предыдущего элемента? <p>Здравствуйте!Скажите, пожалуйста, в чем ошибка: </p>\n<pre><code> punctum='!?.'\n\n for a in range(len(words)):\n  "
        },
        {
            "value": "Воспроизведение mp3 в Python <p>Подскажите, пожалуйста, модуль для воспроизведения mp3-шных файлов, ничего в гугле не найду.</p>"
        },
        {
            "value": "Python форматирование строки <p>Всем доброго дня.\nЕсли если возможность, помогите со скриптом форматирования строки.\nНужно расставлять точки между буквами в строке.\nДопустим у нас есть строка \"string\""
        },
        {
            "value": "Не могу изменить переменную PYTHONPATH <p>Поступаю следующим образом:</p>\n<pre><code>&gt;&gt;&gt; import sys\n&gt;&gt;&gt; sys.path.append('C:\\\\DjangoPJ\\\\Acosta\\\\Blog')\n</code></pre>\n<p>Во время сеанса"
        },
        {
            "value": "Что быстрее regex или стандартный str.replace() <p>Встал вопрос выбора между регулярками и стандартным методом str.replace...\nЧто быстрее ? Как с нагрузкой на компьютер ?</p>"
        },
        {
            "value": "Установка сторонних библиотек для Python в Windows <p>Привет.\nНикак не могу найти статьи, описывающие установку сторонних библиотек python в windows.\nКто нибудь может помочь ссылкой или кратко описать"
        },
        {
            "value": "Подскажите по синтаксису Python: как вставить целые числа в строку <p>Задача обработать несколько файлов, имена которых формируются автоматически в виде <code>file+i+j</code>, где <code>i</code> и <co"
        },
        {
            "value": "Атрибуты виджетов <p>Как узнать все атрибуты, которые есть у виджета?</p>"
        },
        {
            "value": "Присваивание переменных в Python <p>Есть словарь:</p>\n<pre><code>l={'a':1,'b':2}\n</code></pre>\n<p>Потом я получаю значение переменных</p>\n<pre><code>&gt;&gt;&gt;globals().update(l)\n&gt;&gt;&gt;print a"
        },
        {
            "value": "Неактивный элемент в Listbox <p>Подскажите, как сделать элемент в виджете Listbox статическим, неактивным. Например, как в Button АТРИБУТ <code>state [NORMAL, DISABLED]</code>. Listbox тоже имеет этот"
        },
        {
            "value": "Работа с веб-формой методом post <p>Пытаюсь отправить запрос с необходимыми данными в обработчик формы методом POST.</p>\n<pre><code>data = { 'user': 'user', 'pass': 'pass'}\ndataToReq = urllib.parse.ur"
        },
        {
            "value": "Не устанавливается PyXML <p>Доброго времени суток. Требуется произвести XSLT преобразование на Python 2.7, для этого необходимо установить библиотеку PyXML. Но при установке появляется ошибка </p>\n<pr"
        },
        {
            "value": "PySide: как сменить значение всех QLabel? <p>На форме находятся 3 Label, которые нужно сменить, если оставить один Label, то он замечательно меняется в функции. Я решил ввести переменную в виде невиди"
        },
        {
            "value": "Как загрузить файл на сайт через Python? <p>Мне надо загрузить файл на сервер через <code>Python</code> (с компьютера, через форму, как клиент, не как сервер). Точнее, я хочу сделать программу, которо"
        },
        {
            "value": "Как правильно сохранить данные в бд <p>Привет всем, я не понимаю как правильно сделать запись в бд, неправильно не хочу писать и хочется разобраться. \nЕсть пасрер который возвращает список с данными о"
        },
        {
            "value": "Изображение из base64 <p>По сокету получаю изображение в виде base64. Нужно его перекодировать в изображение и вывести на экране через tkinter.</p>\n<p>Подскажите, как перекодировать в изображение и ка"
        },
        {
            "value": "Как добавить русские символы в бд? <p>У меня не получается добавить русские слова в бд. К примеру есть такая модель:</p>\n<pre><code>class Author(models.Model):\n    name = models.CharField(max_length ="
        },
        {
            "value": "Как организовать работу с буфером обмена python? <p>Допросы гугла не дали результатов (если что, у меня windows).</p>"
        },
        {
            "value": "Библиотеки для работы с графикой <p>Какая библиотека больше подходит для создания простой игры аля тетрис или doodle jump.\nПри этом желательно , чтобы эта библиотека имела русскую документацию</p>"
        },
        {
            "value": "Автозагрузка в Win XP <p>Здравствуйте, если кто знает, можете подсказать, как прописать выполнение скомпилированного python скрипта в exe файл, для автоматического его запуска вместе со стартом систем"
        },
        {
            "value": "Будет ли pyc файл запускаться под разными версиями интерпретаторов? <p>Допустим, у меня python 3.2, я скомпилирую свою программку в pyc файл и, например, захочу кинуть её другу, но у него стоит python"
        },
        {
            "value": "Поиск по вхождению строки в django + haystack + Whoosh <p>Имеется некая модель. В ней хранятся названия фильмов. Вот класс индекса: </p>\n<pre><code>from haystack import indexes\nfrom kino.films.models "
        },
        {
            "value": "Как удалить элемент массива в питоне? <p>Почему не работает этот код?</p>\n<pre><code>for a in massiv:\n    for b in massiv:\n        if len(a)&gt; len(b):\n            del b\n        elif len(a)&lt;len(b)"
        }
    ]
}