{
    "questions": [
        {
            "value": "Выдернуть ВСЕ значения атрибута bigimg используя BeautifulSoup <p>Назрел такой вопрос. Только начал изучать питон, используя библиотеку <code>BeautifulSoup</code> задался вопросом. Есть HTML код, к пр"
        },
        {
            "value": "PIL не видит FREETYPE2. ImportError: The _imagingft C module is not installed <p>Ubuntu 11.04, Python 2.7.1+, <strong>виртуальное окружение</strong>.</p>\n<p>$ pip -E test install pil</p>\n<pre><code>--"
        },
        {
            "value": "Ошибка типов \"NoneType object is not callable\" <p>Добрый вечер.<br>\nХотелось бы узнать, как избавиться от данной ошибки.<br></p>\n<pre><code>itemDesc.replace(';', '')\n</code></pre>\n<p>В этой строке воз"
        },
        {
            "value": "Инкрементация в Python <p>Добрый вечер.<br>\nНе могу разобраться в глобальных и локальных переменных. Хотел сделать как проще, вот собственно код:<br></p>\n<pre><code>counter = 1\n\ndef incr():\n    counte"
        },
        {
            "value": "Автозаполнение формы <p>Как сделать заполнение формы по существующим данным для изменения? Если можно, небольшой кусочек кода.</p>"
        },
        {
            "value": "AutoComplete на Django <p>Необходимо реализовать что-то вроде <a href=\"http://djangonaut.blogspot.com/2008/05/jquery-autocompletewidget-django.html\">AutoComplete</a>, но с заполнением одного поля, а о"
        },
        {
            "value": "Проблемы с urllib. Python <p>Здравствуйте. Пытаюсь написать программу, которая бы заходила на аккаунт браузерной игры и выводила бы данные о персонаже.</p>\n<pre><code>import urllib\nimport string\n\nurl "
        },
        {
            "value": "Как реализовать подстановку разных символов в имя функции через %? <p>Есть массив:    </p>\n\n<pre><code>mas = ['a','b','c'] # обязательно символьные элементы массива\n</code></pre>\n\n<p>и есть функции:  "
        },
        {
            "value": "Заполнить форму по условию <p>Подскажите, как реализовать следующие:\nпри заполнении первого поля в форме во втором поле подставились автоматически данные в зависимости от первого. Допустим, выбираем  "
        },
        {
            "value": "Как sys.path добавлять относительные пути для поиска модулей? <p>Как <code>sys.path</code> добавлять относительные пути для поиска модулей?</p>\n"
        },
        {
            "value": "Работа со строками в python <p>Здравствуйте!\nпомогите мне с моей проблемой есть скрипт который обрашяется к бд mysql и с помошью запроса вытаскивает из бд следующие данные имеющие следующий вид: Dlink"
        },
        {
            "value": "Детектор openCV, замкнутый контур <p>Я получил изображение границ через детектор <code>cvCanny</code>. Как теперь максимально быстро найти замкнутые контуры и координаты в него входящие?</p>"
        },
        {
            "value": "Python Threading. Нужен ли локер на данные доступные разным трэдам? <p>Стоит задача организовать переменную состояния, в которую один трэд пишет, другой читает. Господа сишники сразу указали на необхо"
        },
        {
            "value": "Подставить текущего пользователя в форму <p>У меня есть модель:</p>\n<pre><code>class worker(models.Model):\n    user = models.OneToOneField(User)\n    age = models.IntegerField(blank=True, verbose_name="
        },
        {
            "value": "Запись результатов выполнения скрипта в python <p>Здраствуйте!\nУ меня проблема с записью результатов работы скрипта в файл. В этом фрагменте кода:</p>\n<pre><code>print 'ip: ', sw.ip_sw.ljust(15), '\\tl"
        },
        {
            "value": "Наследование в django <pre><code>class SClients(models.Model):\n    swname = models.ForeignKey(s_switch,verbose_name=\"SWITCH\")\n    vlan = models.ForeignKey(s_vlancl,verbose_name=\"VLAN\")\n\nclass s_switch"
        },
        {
            "value": "Как определить есть ли аргументы у функции <p>Как из кода узнать есть ли (сколько и какие) параметры у другой функции?</p>"
        },
        {
            "value": "Настройка прав доступа <p>У меня есть проект на <code>Django</code>. Пытаюсь настроить <code>Pycharm 1.5.4</code>. Проблема в том, что <code>Pycharm</code> запускает процесс от имени пользователя, кот"
        },
        {
            "value": "Считывание из текстового файла чисел <p>Есть текстовый файл, из него надо записать в список числа, заключенные между такими символами \":=\" и \";\", те, например, есть строка \"a:=-1; b:=4\", на выходе пол"
        },
        {
            "value": "Изменения метки в форме <p>Как можно упростить изменения метки в форме? Можно проще и в html менять, необходимо в forms.py</p>\n<pre><code>class SClientsForm(ModelForm):\n   def __init__(self, *args, **"
        },
        {
            "value": "Настройки приватности при публикации фото в Facebook <p>Как-нибудь настраиваются? Используется Graph API, библиотека <a href=\"https://github.com/facebook/python-sdk\">Facebook Platform Python SDK</a>. "
        },
        {
            "value": "Простой пример парсера htmp страницы <p>Прошу простой пример парсера htmp, желательно стардарнными средствами. Гуглил-гуглил, нашел мало чего понятного. Так что, пожалуйста \"тыкните носом\" в ссыль на "
        },
        {
            "value": "Кэш словарей <p>В моем приложение на <code>Django</code> появилась необходимость кэшировать запросы (точнее ответы). Каким образом посоветуете это делать?</p>\n<p>PS Поставить <code>pylibmc</code> не у"
        },
        {
            "value": "Как сделать динамическое меню? <p>Столкнулся с такой проблемой: необходимо сделать меню, которое можно было бы редактировать из админки, и чтобы просто в шаблон вставлялось, например</p>\n<pre><code>{{"
        },
        {
            "value": "Python и http авторизация <p>Как реализовать на Python авторизацию на странице, например, почты, чтобы узнать, сколько новых писем в ящике?</p>"
        },
        {
            "value": "Где взять mod_wsgi для WINDOWS XP x64? <p>Где взять mod_wsgi для WINDOWS XP x64?</p>"
        },
        {
            "value": "Python. Стиль программирования <p>Вопрос очень начального уровня, но интересно мнение со стороны, и возможно советы. </p>\n\n<p>В данный момент я учусь создавать GUI вручную. Появилась одна проблема: по"
        },
        {
            "value": "OAuth на яндекс.фотках, Python, HTTP Error 400 <p>Пишу скриптик на Python, используя urllib2. Хочу получить токен по логину и паролю пользователя.<br>\nВот код:</p>\n\n<pre><code>import urllib2\nimport ur"
        },
        {
            "value": "Идеальный способ зайти в соц. сети и использовать их функции <ul>\n<li>отправки сообщений</li>\n<li>чтения</li>\n<li>перехода по ссылкам</li>\n<li>кликания по формам</li>\n</ul>\n<p>Озадачившись проблемой, "
        },
        {
            "value": "Запись списка в txt файл в питоне <p>Собственно как записать результат работы функции в txt файл?</p>\n\n<pre><code>f = open( '***.txt', 'w' )\nf.write( '??????' )\nf.close()\n</code></pre>\n"
        },
        {
            "value": "Точность чисел <p>Записываю в txt-файл ряд чисел, после запятой остаются 15 цифр, хотя в числе их больше 20.\nТаким образом записываю в файл: </p>\n<pre><code>f = open('ko.txt','w')\nfor item in sn:\n    "
        },
        {
            "value": "Пропинговать диапазон сетей <p>Приветствую!\nПосоветуйте, пожалуйста, способ быстро пропинговать диапазон сетей, используя python. \nБуду чрезвычайно благодарен! ICMP socket.</p>"
        },
        {
            "value": "Литература Python под веб <p>Собс-но, посоветуйте сабж. Приоритетнее была бы такая литература, которая позволила бы легко перейти с РНР.</p>"
        },
        {
            "value": "Подсчет несобственного интеграла с помощью SymPy <p>Нашла вычисление несобственного интеграла (в моем случае от числа до бесконечности).\nПроверяю кусок кода:</p>\n<pre><code>import sympy\nalfaend = 34\nc"
        },
        {
            "value": "С чего начинать для рисования? <p>Надо создать программу в которой должно отображаться 3 фигуры со стереометрии (Куб, Пирамида, Сфера). Размеры - любые, условие чтобы они крутились. Кто может помогите"
        },
        {
            "value": "Функция для ввода строк в Python <p>Пробовал использовать <code>input</code>, но она выводит ошибку при вводе строки. Как можно в консоле вводить строки? Python 2.7.</p>\n"
        },
        {
            "value": "Как оптимизировать поиск в Django <p>У меня есть приложение написанное на питоне (Django). База данных postgres. Хочу оптимизировать поиск. Мои модели:</p>\n<pre><code>class User(models.Model):\n    #so"
        },
        {
            "value": "Каталог, в котором располагается Django <p>ОС -  Linux Debian. Начал читать книгу по Django, а там надо в консоли прописывать\n<code>django-admin.py startproject mysite</code>.\nПрописываю, выводит, что"
        },
        {
            "value": "QT Designer: .ui > .py <p>У меня есть отрисованный в Дизайнере .ui файл. Как мне скомпилить его в .py? Читал, что нужно сделать какой-то батник, но конкретно какой и как вообще это работает - в упор н"
        },
        {
            "value": "Как научиться программировать на питоне? <p>Вот собственно хочу научиться программировать на питоне - опыта никакого нет вообще! Что посоветутете?</p>"
        },
        {
            "value": "Как разбить строку на отдельные символы? <p>Здравствуйте, помогите, пожалуйста, с такой задачей: есть строка </p>\n<pre><code>data = \"sadsadsadsfffffffddd dddsfd dsd\"\n</code></pre>\n<p>Как её разбить на"
        },
        {
            "value": "Не работает программа после комментирования строки. Python <p>У меня почему-то не получается комментировать код в Питоне. Именно после того, как я набрал код в блокноте, если я ставлю # и пишу по-русс"
        },
        {
            "value": "cx_Freeze Python <p>Здравствуйте разработчики. </p>\n<p>Как-то здесь мелькала тема, в которой упоминалась библиотека cx_Freeze для создания бинарников из Python. Большое спасибо тому человеку.</p>\n<p>Т"
        },
        {
            "value": "Как использовать модули в Питон 3? <p>Вот недавно решил скачать себе питон 3 (раньше стоял питон 2) и столкнулся с проблемой:\nне могу использовать команду split из модуля string</p>\n<pre><code>import "
        },
        {
            "value": "Tkinter и команда print в консоль <p>Собственно есть такая проблема: знаю <code>python</code>, понадобился граф.интерфейс, решил воспользоваться встроенной средой <code>Tkinter</code>.<br>\nПроблема в "
        },
        {
            "value": "Прокси функция\\класс <p>Постановка задачи.\nЕсть объект A с методами m1, m2, m3.</p>\n<pre><code> A.m1()\n A.m2()\n A.m3()\n</code></pre>\n<p>Нужно при каждом вызове метода выполнить дополнительное действие"
        },
        {
            "value": "Spynner под Windows <p>Кто-то писал на Python с использование модуля Spynner? Есть скрипт, писаный под линуксом, под ним же затестированный. И нужно запустить его под Windows. Какие подводные камни, к"
        },
        {
            "value": "Как получить случайное число в интервале? <p>Задание псевдослучайной величины из интервала [0,1], как написать?</p>"
        },
        {
            "value": "tuple to dict <pre><code>g = (('a','1'),('a','2'),('b','1'),('b','2'))\ndict((y, x) for y, x in g)\n{'a': '2', 'b': '2'}\n</code></pre>\n<p>Как получить все ключи и значение в dict?</p>"
        },
        {
            "value": "Выравнивание виджета в Tkinter <p>Здравствуйте.\nПродолжая разбираться с графикой, получил следующую проблему, которая относится к выравниванию.\nКак осуществить в <code>Tkinter</code> выравнивание слев"
        },
        {
            "value": "SQLAlchemy pool <p>Пробую использовать <code>SQLAlchemy</code> с <code>pool</code>, выполняю код:</p>\n<pre><code>engine = create_engine('mysql://root:root@localhost:3306/DB', pool_size=10,max_overflow"
        },
        {
            "value": "Интерактивная консоль Python его же средствами (без C) <p>Хотел бы получить такую же интерактивную консоль, как при запуске Python без параметров. С возможностью редактирования написанного, навигации "
        },
        {
            "value": "Работа с русcкими строками.Как узнать индекс одной из букв? <p>Есть строка, состоящая из цифр и букв русского алфавита. Нужно узнать индекс одной из букв.\nПри использовании <code>s.find('Н')</code> вы"
        },
        {
            "value": "Преобразование чисел <p>Я пишу что-то вроде <code>list(str(000000))</code> и получаю <code>['0']</code>, как получить <code>['000000']</code>?\nЕдинственное, что пришло в голову, это найти каждую цифру"
        },
        {
            "value": "Литература по уязвимостям <p>Не подскажите, где можно прочитать про различные уязвимости у интернет проектов? Делаю небольшой сайт на Django. Хочется заранее устранить проблемы.</p>"
        },
        {
            "value": "Заменить элементы строки на значения словаря <p>Здравствуйте, помогите, пожалуйста, с задачей. Есть строка </p>\n<pre><code>st = 'qwqewqewqeggghhhvvvvbvc'\n</code></pre>\n<p>Есть словарь </p>\n<pre><code>"
        },
        {
            "value": "Исполняймые  Python-программы в windows (с exe разширением) <p>Подскажите. пожалуйста, как можно скомпилировать <code>.py</code> в <code>.exe</code> и чтоб программы висели скрыто как сервисы до опред"
        },
        {
            "value": "Порядок удаления элементов списка в python. <p>В нижеприведенном коде я создаю список экземпляров класса A, а потом удаляю его. </p>\n\n<pre><code>class A:\n    def __init__(self, val):\n        self.val "
        },
        {
            "value": "PyQT4 - QTextEdit <p>Сап, Код.</p>\n<p>Начал осваивать гуй на питоне (3 версия), вроде освоился с кнопкой. Но как только понадобилось что-то большее - сразу запор.</p>\n<p>И так, имеется объект <code>QT"
        },
        {
            "value": "Как можно упростить цикл for? <p>Как можно упростить выражение?</p>\n<pre><code>policy = []\nfor i in res2:\n   policy.append(tuple(i))\n\nprint policy\n</code></pre>"
        },
        {
            "value": "Где найти примеры реализации Torrent-клиента? <p>Давно хочу написать свой торрент-клиент, главная причина: хочется лучше разобраться в системе торрентов, ну и нужно отображать рейтинг на различных тре"
        },
        {
            "value": "Python 3.2 Pyside 1.0.8 какое заклинание нужно? <p>Возник вопрос. Нужно заюзать <code>PySide</code> под <code>Python 3.2</code>, но увы не хватает знаний древних заклинаний, чтобы осознать то, что нуж"
        },
        {
            "value": "Как превратить программу написанную на python 3.2 в исполняемый файл? <p>Мне интересно, как сделать из <code>py</code> файл <code>exe</code>, именно на питоне 3.2? Желательно получить инструкцию как э"
        },
        {
            "value": "Форматирование строки. <p>Есть строка вида:</p>\n<pre><code>In [1]: p = '010203040506'\n</code></pre>\n<p>Форматирую:</p>\n<pre><code>In [2]:\"{0}:{1}:{2}:{3}:{4}:{5}\".format(p[:2],p[2:4],p[4:6],p[6:8],p[8"
        },
        {
            "value": "Как мне поступить со списком (list)? <p>Есть список:</p>\n\n<pre><code>&gt;&gt;&gt;&gt;list = [\"tra-ta-ta'123456'list-temp_bla-bla-bla.12\",\"pam-param'list_temp:opa'7'\",\"templa'list_tempte-0'23_.sr\"]  \n<"
        },
        {
            "value": "Как заставить программу нажимать клавиши? <p>Нужно сделать так, чтобы программа сама за меня нажимала кнопки с определенной последовательностью, как это сделать?</p>"
        },
        {
            "value": "Упростить выражение. <p>Есть два списка, находим данные.</p>\n<p>Дано:</p>\n<pre><code>v = [465,641,638,637,644,645,648,689,709,1022,1032,1065,1067]\ng = [(705L,), (637L,), (638L,),]\n</code></pre>\n<p>Пол"
        },
        {
            "value": "Учебники по PyQt4? <p>Есть ли учебники как пользоваться PyQt4?</p>"
        },
        {
            "value": "Как увеличить точность класса float <p>Насколько я знаю, точность типа <code>float</code> в <code>python</code> ограничена 16 знаками после запятой. Мне необходимо около 40 знаков после запятой. И вот"
        },
        {
            "value": "Установка  модулей  других  разработчиков <p>Помогите, пожалуйста, разобраться детально, как именно установить модули других разработчиков.</p>"
        },
        {
            "value": "django redirect <pre><code>def auth_form(request):\n    if request.POST:\n        form = AuthForm(request.POST)\n        if form.is_valid():\n            l = form.cleaned_data['login']\n            p = for"
        },
        {
            "value": "Блоги о C++ и Python <p>Предлагаю поделиться блогами/сайтами/прочими ресурсами, которые вы постоянно читайте и просматривайте.</p>\n<p>C++:</p>\n<ul>\n<li><a href=\"http://alenacpp.blogspot.com\">Алена С++"
        },
        {
            "value": "Списки отображения <p>Ребята, вопрос простой, но точно я на него ответ не могу найти (или понять). Есть в OpenGL понятие - список отображения, в нем во время инициализации один раз рисуются все заявле"
        },
        {
            "value": "Как запустить программу из QTDesigner? <p>Вот, значит, решил опробовать PyQt4 и создал через <code>QtDesigner</code> графический интерфейс, перевел его в <code>.py</code> и вот что получилось! Как теп"
        },
        {
            "value": "Файловый ввод в Python <p>Как эффективно организовать ввод данных в python 3.1, например такого вида:</p>\n\n<blockquote>\n  <p><code>текстовый файл input.txt\n  5 \n  23 43 45 32 12</code></p>\n</blockquot"
        },
        {
            "value": "Функция поиска по широте и долготе <p>Помогите, если кто знает решение =) Функция поиска по широте и долготе. Мне нужно, чтобы при вводе неправильного значения она не возбуждала всякие исключения, а п"
        },
        {
            "value": "Вызов метода класса перед его определением <pre><code>class TestModel(models.Model):\nimage   = models.ImageField(upload_to=getUploadPath, blank=True, verbose_name=u'Изображение')\n\ndef getUploadPath(in"
        },
        {
            "value": "Создание обобщенного шаблона <p>Здравствуйте уважаемые знатоки Django!\nСам я не первый год знаком с python и с недавнего времени начал все стороннее осваивание django и у меня возник вопрос:\nвозможно "
        },
        {
            "value": "Проверка введенного содержимого <p>Мне нужно, чтобы пользователь вводил числа типа <code>float</code>, и в то же время мог ввести \"-h\" or \"close\". Как проверить введенную строку на содержание <code>fl"
        },
        {
            "value": "ChoiceField, доступ к видимому значению <p>с помощью django.forms делаю dropdown меню, как поле ChoiceField. Варианты задаю как кортеж:</p>\n<pre><code>class MyForm(forms.Form):\n\nCHOICES = (\n    ('CH1'"
        }
    ]
}