{
    "questions": [
        {
            "value": "Загрузка модели из xml <p>Как в Django 1.3 сделать чтобы модель загружалась из xml файла? И если не существует таблицы для этой модели, то она должна создаваться.\nПерерыл всю документацию по джанго, н"
        },
        {
            "value": "Вывод значений с двумерного массива <p>Есть изображение 10х10 пикселов, мне надо считать информацию о цвете каждого пикселя и записью в текстовый файл. Но перед этим я захотел просто проверить, как ОН"
        },
        {
            "value": "Как поставить две версии ActivePython на одну систему? <p>Конкретно нужно поставить ActivePython 2.7 и 3.0 на Windows 7.\nЛюди предлагают вызывать нужный интерпретатор командой <code>python2</code> и <"
        },
        {
            "value": "Подскажите функцию для экранирования <p>В общем, нужна функция, которая будет экранировать символы. Точно так же как и ``. Есть ли она в питоне? И есть ли функция, которая делает обратную операцию?<br"
        },
        {
            "value": "Подскажите совсем небольшие opensource проект на python <p>Подскажите совсем небольшие opensource проекты на python, желательно с использованием wxPython. Только не надо предлагать там что-нить из как"
        },
        {
            "value": "Разработка программ на Python <p>Добрый день! Подскажите, пожалуйста, у меня есть пара вопросов...</p>\n<ol>\n<li>Можно ли код, написанный под Python, скомпилировать в исполняемый файл?</li>\n<li>Подходи"
        },
        {
            "value": "Что такое \"зависимости\" и какие проблемы могут быть связаны с ними? <p>Может кто-то объяснить понятным языком, что такое \"зависимости\" и какие проблемы могут быть связаны с ними?</p>\n\n<p>Я так понимаю"
        },
        {
            "value": "codec can't encode characters <p>Вот, значится, код, который должен использовать простенькую форму с кнопкой и лейблом.</p>\n<pre><code>#-*- coding: utf-8 -*-\nfrom PyQt4 import uic, QtCore, QtGui, uic\n"
        },
        {
            "value": "Посоветуйте учебник по Python <p>Здравствуйте, огромная просьба помочь мне с выбором учебника по Python. Уровень знаний о программировании на Python по 10-ти бальной шкале где- то в районе 0.5 .</p>\n<"
        },
        {
            "value": "Регулярное выражение для получения BBCode URL <p>Чем этот код:</p>\n\n<pre><code>icons = re.findall(r'&lt;div class=\"post1\" id=\"_all_groups\" style=\"display: none; position: absolute; z-index: 3;\"&gt;(.*"
        },
        {
            "value": "glob_fileinput: как прочитать все файлы один раз и найти нужное? <pre><code>def One():\n  duble = []\n  for l in open(\"log.log\"):\n    duble.append(l)\n\n  for i in set(duble):\n    f = Two(i.rstrip())\n\ndef"
        },
        {
            "value": "И вновь регулярки (парсинг) <pre><code>&gt;&lt;!-- Begin Topic Entry 1053094 --&gt;\n&lt;tr&gt; \n    &lt;td align=\"center\" class=\"row1\" id='tid-folder-1053094' onclick='return topic_toggle_folder(\"1053"
        },
        {
            "value": "Среда разработки для python под windows <p>Подскажите хорошую среду разработки для python для windows. С автокомплитом, подсветкой, средствами рефакторинга и возможностью запуска на выполнение прямо в"
        },
        {
            "value": "Не ставится Python на Windows XP <p>Друзья, помогите, пожалуйста, справится со следующей ситуацией:\nустанавливаю любой питон(например python-2.6.6.msi), скачанный с офф сайта питона, и при установке п"
        },
        {
            "value": "Python. UnEscape. \"\\\\x32\" -> \"2\" <p>Собственно нужно следующее:</p>\n<pre><code>&gt;&gt;&gt; s = \"\\\\144\\\\x65\\\\143\\\\x6f\\\\144\\\\x65\"\n&gt;&gt;&gt; s_unesc = s.some_func()\n&gt;&gt;&gt; s_unesc\n\"decode\"\n</co"
        },
        {
            "value": "Вывод результата двумя столбцами <p>Имеем два цикла:</p>\n<pre><code>for a1 in r1:\n    print a1\n\nfor a2 in r2:\n    print a2\n</code></pre>\n<p>Вопрос, как вывести два столбца в один результат, например:<"
        },
        {
            "value": "Что такое __all__ в Python? <p>Объясните, пожалуйста, что такое <code>__all__</code> (я так понимаю, это некий список), в каких случаях он используется в Python и как это применяется при импортировани"
        },
        {
            "value": "Как лучше разбираться с OpenSource проектом новичку? <p>Подскажите советами.</p>\n<p>Столкнулся с такой проблемой, что нужно разобраться с одним OpenSource проектом (20 000 строк кода). Документации по"
        },
        {
            "value": "Сортировка списка <p>Есть список:\na = ['0 10.0.41.161', '2 10.3.4.59', '10 10.8.33.6', '3 10.3.4.155' '20 10.3.4.75', '16 10.3.4.134']</p>\n<p>Как отсортировать список по данным 0, 2, 10, 3, 20, 16? Ме"
        },
        {
            "value": "Непонятый TypeError <pre><code>mainicon = re.findall(r'&lt;img src=\"(.*)\" alt=\"Group Icon\"', accs[i][0])\n\nTypeError: expected string or buffer\n</code></pre>\n<p>Точно знаю, что accs[i][0] - строка. Что"
        },
        {
            "value": "Django ORM выбор связаных моделей <p>У меня есть 2 модели</p>\n<pre><code>class menu(models.Model):\n    title = models.CharField(max_length=255)\n\nclass item(models.Model):\n    title = models.CharField("
        },
        {
            "value": "Нейронные сети на Python для \"чайника\" <p>Часто встречаю такое понятие, как нейронные сети и, учитывая еще и тот факт, что потихоньку изучаю Python, то возникла потребность \"что-то эдакое\" попробовать"
        },
        {
            "value": "Проблемы с кодировкой <p>Доброе время суток, решил изучить Python и тут же - рогами в стену. ))</p>\n<p>Написал прогу по книге</p>\n<pre><code># -*- coding: utf-8 -*-\nfrom Tkinter import*\nclass But_prin"
        },
        {
            "value": "Контроль курсора при вводе текста в консоли <p>Пишу одну программу, в которой от пользователя требуется периодически вводить данные.\nПри вводе в консоли, при попытке вернуться назад/вперед по тексту ("
        },
        {
            "value": "No module named locals. Pygame <p>Запускаю скрипт (.py):</p>\n<pre><code>import pygame\nfrom pygame.locals import *\npygame.init()\npygame.display.set_mode((640, 480))\npygame.display.set_caption('Fdd')\npy"
        },
        {
            "value": "CGI Python проблема с кодировкой. <p>Добрый день.</p>\n<p>Подскажите идеи пожалуйста, есть такая задача - CGI-приложение из веб-формы получает данные, а потом по ним заводит пользователя в Zimbra (путе"
        },
        {
            "value": "GUI фреймворки wxPython и GTK в коммерческой разработке <p>Возник такой вопрос: используются ли в коммерческой разработке GUI фреймворки: wxPython (wrapper над wxWidgets) и GTK(PyGTK, gtkmm)?</p>\n<p>Ж"
        },
        {
            "value": "Обмен данными между родительским и дочерним процессом в Python <p>Добрый день. Есть родительский и дочерний процессы. Дочерний создан модулем subprocess. Возможен ли кросс-платформенный способ постоян"
        },
        {
            "value": "Возможности Python для программ на контроллерах Atmel <p>Кто-нибудь пробовал использовать Python для создания программ для микроконтроллеров Atmel?\nХотелось бы попробовать установить python в КПК.</p>"
        },
        {
            "value": "Как сгенерировать код в Qt Designer (PyQt)? Как сгенерировать код в Qt Designer (PyQt)?"
        },
        {
            "value": "Как по Ctrl+C выйти из одной функции и продолжить выполнение в другой? <p>Есть скрипт</p>\n<pre><code>def One():\n\n...\n\ndef Two():\n\n...\n\ndef Three():\n\n...\n</code></pre>\n<p>и т.д.</p>\n<p>Необходимо нажат"
        },
        {
            "value": "Импорт модуля radiusd от freeradius <p>Использую в своих проектах freeradius с вязкой SQL+FILES модулями, необходимо прикрутить модуль radiusd от freeradius, но никак ладу дать не могу, где его взять,"
        },
        {
            "value": "Растягивание рисунка вместе с окном в Tkinter <p>Как реализовать в Tkinter растягивание рисунка на компоненте Canvas при растягивании окна?</p>\n"
        },
        {
            "value": "Как проверить число на четность? <p>Понимаю, что надо делить на 2 и смотреть на остаток. Вот что пытался делать.</p>\n\n<pre><code>if ( not line%2 ):\n    print 'chek true'\n</code></pre>\n"
        },
        {
            "value": "Как вытащить из файла нечётные строки? <p>Надо пропарсить файл с ip адресами. Из файла надо получить последнее слово каждой нечетной строчки (там ip). Делал так:</p>\n<pre><code>def main():\n\n    infile"
        },
        {
            "value": "Форма введения числа и вывода факториала <p>Как в django сделать форму введения числа и вывода его факториала после нажатия кнопки? Нужна сама идея.</p>\n<p>Пример: вводите в формочку число 5, жмете кн"
        },
        {
            "value": "Как вернуть число в socket.inet_aton? <pre><code>print socket.inet_ntoa(struct.pack('!L',-268500892))\n</code></pre>\n<p>239.255.0.100</p>\n<p>Как получить назад число? Если </p>\n<pre><code>print struct."
        },
        {
            "value": "Как установить пакет wxPython 2.8 для Mandriva ? <p>Мне для Python нужно в Mandriva 2005 (дада, именно под эту версию) установить wxPython версии 2.8.</p>\n<p>Для ubuntu это делалось так </p>\n<pre><cod"
        },
        {
            "value": "Как передаются данные из форми во вьюшку методом POST? <p>Как передаються данные из форми во вьюшку методом POST? Объясните на пальцах, плз, и если можно, банальный пример (например, передача из формы"
        },
        {
            "value": "Как правильно прописать пути в PATH для python2.6? <p>У меня есть стенд и на нём стоит дистрибутив Linux Mandriva 2005. Именно его и нужно использовать. Там по умолчанию стоит python версии 2.4. Я ска"
        },
        {
            "value": "Асинхронный сервер на python <p>Как можно реализовать сервер на python который будет обрабатывать сразу несколько подключений? Желательно с примером.</p>"
        },
        {
            "value": "Как упростить if? <p>Есть длинное условие:</p>\n<pre><code>if j==465 or j==641 or j==465 or j==641 or j==638 or j==637 or j==644 or j==645 or j==648 or j==1120 or j==1122 or j==1124 и т.д.\n</code></pre"
        },
        {
            "value": "Связать в одном поле 2 модели? <p>У меня есть 3 модели:</p>\n<pre><code>class category(models.Model):\n   title = models.CharField(max_length=255, verbose_name='название')\n\nclass page(models.Model):\n   "
        },
        {
            "value": "С чего начать в написании веб-приложения? <p>Мне необходимо написать веб-приложение \"фотосайт\" на <code>python</code>, используя <code>pylons</code>. Кто-нибудь может мне показать пример кода. И с чег"
        },
        {
            "value": "Обращение к сторонней MYSQL-базе <p>Есть самописный скрипт, который парсит ники с одной хмл-странички. Все, что мне нужно, это по каждому из ников сделать запрос в стороннюю mysql-базу. В строке базы "
        },
        {
            "value": "Ошибка кодировки в Python: readline() при чтении utf-8 файла ругается: 'charmap' codec can't decode byte <p>Пытаюсь читать файл портов от IANA. Он сохранен в кодировке UTF-8 w/o BOM.\nНо на одной из ст"
        },
        {
            "value": "Уникально идентифицировать пользователя <p>Всем добрый день! Появилась необходимость уникально идентифицировать пользователя, притом не испоьзуя регистрацию. Т.е. пришел анонимный юзер - и нужно запис"
        },
        {
            "value": "В чем причина ошибки? <blockquote>\n<p><code>Error: rlm_python:EXCEPT:&lt;class '_mysql_exceptions.OperationalError'&gt;: (2006, 'MySQL     server has gone away')</code></p>\n</blockquote>\n<pre><code>db"
        },
        {
            "value": "pyQT динамический QLabel <p>Как можно в бесконечном цикле изменять <code>QLabel</code>? Т.е. надо посекундно обновлять <code>QLabel</code>, но если впихнуть в код такой цикл, <code>QTGui</code> не ини"
        },
        {
            "value": "Нужен пример использования SQL-скрипта в Django <p>Ситуация: изменили схему модели (добавили одно поле, удалили другое). Нужно написать SQL-скрипт (я так понимаю, с ALTER'ми), чтобы при его вызове вно"
        },
        {
            "value": "Почему выскакивает \"This field is required\"? <p>Ситуация - часть из <code>models.py</code> (модифицированый пример из туториала Джанги): <br>\n</p>\n<pre><code>class Category(models.Model):\n    cat_name"
        },
        {
            "value": "Простой сервер python под Винду <p>Доброго времени суток.<br>\nНе подскажете какой-нибудь простой python веб-сервер под Винду для тестирования скриптов на локалхосте? Очень желательно, чтобы старт/стоп"
        },
        {
            "value": "Запуск Cygwin из python приложения и последующее выполнение команд <p>У меня установлена программа Cygwin (UNIX-подобная среда и интерфейс командной строки для Microsoft Windows). Мне необходимо из мо"
        },
        {
            "value": "tcp клиент на python <p>Делаю бота на python, он должен реагировать на сообщения от сервера, то есть примерно такой алгоритм</p>\n<ol>\n<li>Занимаемся своими делами..</li>\n<li>Если пришло сообщение обра"
        },
        {
            "value": "python 2.X и unicode-строки <p>Перешел на 2.7 c 3.2 версии и теперь не получается элементарное в 3.2 действие: запись юникод-строки в файл.</p>\n<p>Получаю из сети страницу и парсю ее lxml, получаю, на"
        },
        {
            "value": "PySNMP and NetSNMP <p>Есть два модуля <a href=\"http://pysnmp.sourceforge.net/\">PySNMP</a> и <a href=\"http://www.net-snmp.org/wiki/index.php/Python_Bindings\">NetSNMP</a>.</p>\n<p>Производительность  PyS"
        },
        {
            "value": "Как добавить Items в treectrl <p>Добрый день. Как добавить элемент второго уровня в дерево.</p>\n<pre><code>self.tree_ctrl_1.AddRoot('1')\n</code></pre>\n<p>Работает, а когда пишу:</p>\n<pre><code>self.tr"
        },
        {
            "value": "Вывод результатов 2 запросов в временную таблицу MySQL <p>Здраствуйте!</p>\n<p>Подскажите, пожалуйста, как в коде языка python реализовать такую конструкцию: нужно выполнить 2 запроса в базу mysql и вы"
        },
        {
            "value": "Как сравнить два списка? <p>Извините за глупый вопрос.</p>\n<pre><code>g = ['mon1-1','mon2-2','mon3-3']\ng2 = ['mon1-1','mon2-2']\n</code></pre>\n<p>Как сравнить g с g2 (два списка), если значение не найд"
        },
        {
            "value": "Просмотр таблицы в pysnmp <p>Цель - хочу просмотреть выбрать мак-адреса из таблицы snmp.</p>\n<pre><code>cmdGen = cmdgen.CommandGenerator()\ncmdGen.ignoreNonIncreasingOid = True\nerrorIndication, errorSt"
        },
        {
            "value": "Какую библиотеку web-парсинга для python выбрать? <p>Слишком много в сети разных холливаров, и совсем не хочу и здесь читать такое. Сейчас вплотную подошел к выбору, но не знаю, какую библиотеку выбра"
        },
        {
            "value": "Как выбрать из строки? <p>Объясните, пожалуйста, есть строка:</p>\n<p><code>&lt;td&gt;&lt;span class=small&gt;1.&lt;/span&gt;&lt;br&gt;&lt;a href='/roder/re3rr70' title='0r0t3 (1et).jpg'&gt;picture&lt;"
        },
        {
            "value": "Как передать преобразованную дату? <p>Есть views</p>\n<pre><code>res = SSwAlive.objects.filter(is_deleted=0)\nreturn render_to_response('test.html',{'res':res})\n</code></pre>\n<p>Данные в res</p>\n<pre><c"
        },
        {
            "value": "Вывод результата. <pre><code>cat models.py\nfrom django.db import models\nfrom datetime import datetime\n\ndef GetInHMS(seconds):\n    hours = seconds / 3600\n    seconds -= 3600*hours\n    minutes = seconds"
        },
        {
            "value": "Ссылки на другую страницу <p>Поясните, пожалуйста! Как сделать на django ссылку на запрос. Например:</p>\n<pre><code>поле1 поле2 поле3\n</code></pre>\n<p>Нажимаем на поле1, берется переменная поле1, отпр"
        },
        {
            "value": "Как преобразовать ответ на запрос в MAC устройства? <p>Приветствую!</p>\n<p>Учусь Питону, возник вопрос с примером:</p>\n<pre><code>from pysnmp.entity.rfc3413.oneliner import cmdgen\n\nerrorIndication, er"
        },
        {
            "value": "Метод в property <p>Часто вижу что методы у моделей превращают в property. Иногда это делают через декоратор @property, а иногда через property(method_name).</p>\n<p>Зачем? Ведь из шаблонов они все рав"
        },
        {
            "value": "Как создать сервис soap на django? Как создать сервис soap на django?"
        },
        {
            "value": "Алгоритм выборки из БД без дублей <p>Имеется база данных SQLite3, в ней 2 поля:<br>\n</p>\n<ol>\n<li>строка;</li>\n<li><code>crc32</code> этой строки. </li>\n</ol>\n<p>Нужно за минимально короткое время и с"
        },
        {
            "value": "Как определить, жив ли процесс? <p>Как стандартным питоновским модулем определить, жив ли другой процесс (по <code>pid</code>)? </p>\n<p>Собственно, есть ли простое и красивое решение вопроса? Как реши"
        },
        {
            "value": "Работа с формы основанными на моделях <p>Как будет правильнее, копировать поля из модели или по новой описывать форму с полями? Или все зависит от случая как использовать форму?</p>\n<pre><code> class "
        },
        {
            "value": "Сбор мыла на сайте ответы маил ру <pre><code>import urllib\nimport os\nimport re\nimport smtplib\nfrom email.mime.text import MIMEText\nimport time\n\nusedEmails = []\nnum = 0\n\nwhile True:\n    u = urllib.urlo"
        },
        {
            "value": "Как сделать ссылку на модель, которая ещё не объявлена? <p>Имеется модель:\nmodels.py</p>\n<pre><code>class Country(models.Model):\n    id = models.IntegerField(primary_key=True, unique=True) # Код стран"
        },
        {
            "value": "Запуск python-скрипта из c++ <p>Есть скрипт, который выполняет генерацию файла. Как его запустить, передав ему аргумент?\nСвою ошибку понял. Уточняю, ос Windows.</p>"
        },
        {
            "value": "Проверка mac-address <p>Есть ссылка на готовое решение проверки mac-адреса <a href=\"http://djangosnippets.org/snippets/1337/\">проверка mac-address</a>.\nЯ так понимаю, кусок кода нужно разместить в <co"
        },
        {
            "value": "Python imports <p>Добрый день!</p>\n<p>Используя конструкцию вида:</p>\n<pre><code>from a import *\n</code></pre>\n<p>Но не используя все классы/функции и т.п. из <code>a</code>, можно ли сказать, что это"
        },
        {
            "value": "Как подружить Python и C++ | Python to bin/exe <p>Здравствуйте еще раз.</p>\n<p>Стоит задача переписать существующие классы/структуры данных в Python на C.\nСлабо пока себе представляю, как это должно р"
        },
        {
            "value": "Интерактивный ping <p>Как организовать ping интерактивно? Мой вариант тоже работает, но необходимо подождать...</p>\n<pre><code>def pings(request, phost):\n  a = subprocess.Popen('ping -n -c 3 -W 2 %s' "
        },
        {
            "value": "Метод save() <p>Есть заполненная форма, которая записывается через метод <code>save()</code>, как перед тем, как записать сделать небольшие изменения над полем, и тогда записывать в базу?</p>"
        },
        {
            "value": "Как определить поименно *args, которые передаються с командой? <p>Есть менеджер-команда, которю я вызываю </p>\n<pre><code>manage.py commandname x y\n</code></pre>\n<p>где х и у - аргументы, которые буду"
        }
    ]
}