{
    "questions": [
        {
            "value": "Как из скрипта на Питоне послать письмо с вложением? <p>Нужен простейший пример посылки письма с вложением через внешний SMTP сервер, например, smtp.yandex.ru.</p>"
        },
        {
            "value": "Почему скрипт на Питоне не понимает юникод? <p>Скрипт:</p>\n<pre><code>#! /usr/bin/env python    \nprint &quot;Привет&quot; \n</code></pre>\n<p>Выдает ошибку:</p>\n<pre><code>File &quot;./y.sh&quot;, line "
        },
        {
            "value": "Почему строки с fuzzy в django.po не переводятся? <p>Я обновляю файл django.po таким образом:</p>\n<pre><code>$ python manage.py makemessages -l ru\n$ python manage.py compilemessages -l ru\n</code></pre"
        },
        {
            "value": "Наследование абстрактного класса и многотабличное наследование  в Python <p>В чем отличие наследования от абстрактного класса и многотабличного наследования в Python, в частности в платформе Django? Х"
        },
        {
            "value": "Глобальные переменные в Python: сохранить локальную переменную от вызова к вызову функции <p>У меня есть функция, которой необходимо сохранять значение от вызова к вызову, при этом это значение исполь"
        },
        {
            "value": "Вложенные кавычки в строке Питона <p>Каков полный список способов, которыми в Питоне можно записать строку, содержащую вложенные кавычки?</p>\n<pre><code>quote = \"\\\"\"\n</code></pre>"
        },
        {
            "value": "IDE для Python <p>Среды разработки и текстовые редакторы для разработки на Python. Их плюсы и минусы.</p>"
        },
        {
            "value": "Два словаря, Python <p>Имеются два словаря, необходимо исключить один словарь из другого. Как это сделать наибыстрейшим способом? Изначально задача стояла по-другому. Имеется набор объектов, и по их i"
        },
        {
            "value": "Python + GWT <p>Пробовал ли кто скрестить python и gwt? Прошу поделиться опытом и мнениями по данному направлению.</p>"
        },
        {
            "value": "Конвертация строк, Python <p>Как из обычной строки сделать юникод строку? Проблема в том, что выпадает такое сообщение</p>\n<blockquote>\n<p>UnicodeEncodeError:<br>\n'ascii' codec can't encode characters"
        },
        {
            "value": "Отладка кода на Питоне <p>Имеется проект написанный на Питоне. Я разрабатываю его на платформе Убунту, в текстовом редакторе. Какими средствами надо воспользоваться, чтобы получить возможность пошагов"
        },
        {
            "value": "Ssh  в PyCharm <p>Хочу использовать для своего проекта JetBrains PyCharm 1.0.1. Скачал, поставил. Я работаю в среде Windows XP, а код находится на Linux сервере без иксов. Пытался найти как создать ss"
        },
        {
            "value": "Книги по Python <p>Решил заняться программированием. Выбрал \"питон\". Прошу, дайте названия, а лучше прямую ссылку на мануал. Заранее спасибо.</p>"
        },
        {
            "value": "Выбор почтового клиента <p>У меня имеется система, написанная на С++ в стили С, которая должна в определенный момент отсылать сообщение на почту пользователю. Система кросс платформенная, собирается п"
        },
        {
            "value": "Шифрование на Питоне <p>Посоветуйте библиотеку для шифровки и расшифровки на Питоне.</p>"
        },
        {
            "value": "Создание картинки на лету <p>Есть HTML страница, которая создается шаблонами Django. На эту страницу проставляется внешняя ссылка с другого ресурса. Необходимо на лету создать для ссылки из страницы к"
        },
        {
            "value": "Плагины для eclipse <p>Есть надобность в использование javascript, html, css, python, стоит ли поискать для этого дела плагин к eclipse. Кто использовал, расскажите о проблемах, которые встретились вк"
        },
        {
            "value": "Парсинг POST запросов на python <p>Конкретный пример. Есть простенькая html форма:</p>\n<pre><code>&lt;form action=\"http://localhost:8000/submitPage\" method=\"POST\" enctype=\"multipart/form-data\"&gt;\n   "
        },
        {
            "value": "Фильтр в Джанго <p>Чего-то не получается сделать фильтр в питоне. Идея такая: Мне надо выбрать все объекты у которых нет не одного потомка и тех, у которых потомки имеют бал равный нулю. Я могу написа"
        },
        {
            "value": "Кэш страниц, Python <p>Как сделать так, чтобы страницы отданные питон-движком, джанго, не кэшились на клиентской стороне?</p>"
        },
        {
            "value": "Проблема с вызовом __setitem__ <p>Пытаюсь унаследовать класс <a href=\"http://wwwsearch.sourceforge.net/mechanize/\"><code>mechanize</code></a><code>.Browser</code>:</p>\n<pre><code>from mechanize import"
        },
        {
            "value": "Как на Python определить фон ячейки в Excel? <p>Использую расширения xlrd для работы с файлами Excel. Не могу разобраться, каким образом определить цвет фона ячейки, на которую в настоящий момент указ"
        },
        {
            "value": "Ошибка выборки из базы <p>У меня есть модель. Я добавил в неё новое поле. Далее выполнил след. команды:</p>\n<pre><code>sudo -u owner python manage.py migrate my_app\nsudo -u owner python manage.py sync"
        },
        {
            "value": "Выслать сообщение по почте при падении сервиса и автоматически его поднимать обратно <p>У меня стоит сервер IP телефонии (PBX - trixbox). Это дело у меня висит под линуксом CentOS 5. Скрипт должен выс"
        },
        {
            "value": "Двойная интерпретация в шаблонах Django <p>Язык шаблона Django - это полноценный язык, который интерпретируется Питоном. Следовательно, в процессе создания страницы HTML из шаблона Django происходит д"
        },
        {
            "value": "Как посмотреть global default timeout setting? <p>Есть необходимость использовать:</p>\n<pre><code>class poplib.POP3(host[, port[, timeout]])\n</code></pre>\n<p>В <a href=\"http://docs.python.org/release/"
        },
        {
            "value": "Как редактировать программу в IDLE? <p>Начал самостоятельно изучать Питон. Как в IDLE исправлять ошибки после выхода синтаксической ошибки? Неужели все переписывать?</p>"
        },
        {
            "value": "Арифметические операции в шаблонах Django <p>Подскажите, существует ли возможность осуществлять арифметические операции с данными непосредственно в шаблонах, и если есть, то как?</p>"
        },
        {
            "value": "Русские названия полей базы данных в админке <p>Вопрос банально простой, но что-то не разобрался... Как сделать, что бы в админке отображались русские названия для полей базы данных? Что нужно прописы"
        },
        {
            "value": "Процентное соотношение языков веб-программирования <p>Какой процент веб-приложений в интернете написан с использованием таких языков как Python, Ruby и Lua? Есть ли смысл переходить с PHP на какой-либ"
        },
        {
            "value": "Механизм сообщений в сервере <p>Пишу игровой сервер на twisted, дошел до части, когда нужно сделать механизм событий. \nЭтот механизм должен создавать какие-либо события, которые должны произойти в буд"
        },
        {
            "value": "Частота слов в тексте <p>Ниже приведенный скрипт на Python подсчитывает частоту слов в тексте (непрерывных последовательностей букв за исключением знаков препинания) и выводит таблицу результатов. </p"
        },
        {
            "value": "Как в Python перехватить системное событие MouseClick? <p>Возможно, не совсем ясно выразился. Стоит задача определения места (координат) клика по окну (отдельное приложение). Координаты определяю с по"
        },
        {
            "value": "Как определить строку, вызвавшую Exception в Python 2.x? <p>Код выглядит так:</p>\n<pre><code>try:\n    ...\n    ...\n    ...\n    ...\nexception Exception, e:\n    print str(e)\n</code></pre>\n<p>Периодически"
        },
        {
            "value": "Конвертор кода на python в код на C или C++ <p>Не подскажете такой под линукс? И ссылочку бы..</p>"
        },
        {
            "value": "SNMP-библиотека для Python <p>Кто как считает: какая из библиотек, реализующая поддержку данного протокола наиболее удачна? Погуглив, я нашел только две: </p>\n<ol>\n<li>pysnmp</li>\n<li>twistedSNMP</li>"
        },
        {
            "value": "Скрипты на Андроиде? <p>Есть ли способ запускать скрипты на Андроиде, например, JavaScript или Python? </p>"
        },
        {
            "value": "XMPP Python 3 <p>Какие модули есть для 3-тего Python'a для работы с протоколом xmpp?</p>"
        },
        {
            "value": "Проблема python и poplib с получением писем <p>Привет. Использую для чтения писем с почты на gmail.com либу poplib. Вот код:</p>\n<pre><code>import poplib  \nimport time  \nfrom email.Parser import Parse"
        },
        {
            "value": "Java или Python? <p>По производительности в разных источниках пишут разное, в одних что Python в десятки раз медленнее, по другим источникам одного порядка. Вообще какие минусы есть у них относительно"
        },
        {
            "value": "Python  литература на русском <p>Есть ли литература на русском про PyGtk, PyGame, Python opengl?</p>"
        },
        {
            "value": "Python urllib заголовки <p>Нужно достать информацию из заголовка. Заголовок взял так <a href=\"http://www.info\">www.info</a>()</p>\n<blockquote>\n<p>Server: nginx/0.8.54<br>\nDate: Tue, 17 May 2011 16:06:"
        },
        {
            "value": "Графика (рисунок по точкам) на Python <p>Начала изучать питон с целью написания одного маленького приложения на вывод графических данных, поискала разный материал по языку и столкнулась с отсутствием "
        },
        {
            "value": "Проблема при парсинге файла <p>Использую Python 2.6.1 на ОС Linux Ubuntu. Выполнял считывание данных из файла, и потом создавал словарик. Раньше все было ок. На данный момент решил использовать тот же"
        },
        {
            "value": "Подключить к PHP-скрипту фрагмент кода, написанный на Python <p>а возможно ли подключить к PHP-скрипту фрагмент кода, написанный на Python ?</p>"
        },
        {
            "value": "Где скачать самоучитель по Python и как создать игру? <ol>\n<li>Где можно скачать хорошие и понятные для школьника курсы по языку Python?</li>\n<li>Как создать компьютерную игру? Уточняю: какие для этог"
        },
        {
            "value": "Django и cron <p>Возникла задача выполнять скрипт по расписанию. Вот начал гуглить и встал вопрос, актуально ли сейчас использовать <a href=\"http://code.google.com/p/django-cron/\">django-cron</a> или "
        },
        {
            "value": "Количество элементов в таблице <p>Как наибыстрейшим способом определить количество элементов в таблице? Я делаю так:</p>\n<pre><code>u_count = len(User.objects.all().distinct())\n</code></pre>\n<p>Запрос"
        },
        {
            "value": "Python on Embedded <p>Есть ли платформа, на которой одновременно можно разработать и протестировать скрипт? Имею ввиду мобильную платформу. Где скрипты могли бы играть роль исполняемых файлов (chmod u"
        },
        {
            "value": "Не корректно работает urlopen? <blockquote>\n<p><code>raise HTTPError(req.get_full_url(), code, msg, hdrs, fp)</code><br>\n<code>HTTPError: HTTP Error 407: Proxy Authentication Required ( The ISA Server"
        },
        {
            "value": "Что должен знать Web разработчик на python? <p>То что надо знать html, css, javascript, mysql это само собой, а что ещё?<br>\n 1. С какими библиотеками надо/желательно работать.<br>\n 2. Фреймворки? (пл"
        },
        {
            "value": "Задание кодировки при создании файла <p>Cоздаю файл самым простым способом</p>\n<pre><code>open(\"file.txt\" , \"w\")\n</code></pre>\n<p>А можно как-нибудь указать кодировку? Допустим, хочу поставить utf-8.<"
        },
        {
            "value": "Язык с семантикой Python и Си-подобным синтаксисом <p>Подскажите такой язык (если такой есть).</p>"
        },
        {
            "value": "Изучение ООП в Python <p>Друзья, подскажите, пожалуйста, с чего лучше начать изучать ООП в Python-e.</p>"
        },
        {
            "value": "Подключение css в шаблоне Django <p>Доброго Всем дня! У меня есть проект \"proj\" на Django, в нем создано приложение \"blog\". В файле \"..../proj/blog/templates/page.tpl\" нужно подключить файл \"style.css"
        },
        {
            "value": "Передача переменной через redirect_to и request.user в urlpatterns <p>Суть проблемы: делаю редирект в urlpatterns функцией redirect_to на определённый адрес, нужно попутно передать русскую строку текс"
        },
        {
            "value": "Расположение окна по центру Tkinter <p>Как задать расположение окна по центру экрана?</p>"
        },
        {
            "value": "Работа с icq <p>Нужно сделать программу чат на icq. Есть какие-нибудь библиотеки для работы напрямую с icq (желательно с русскими manual'ами)?</p>"
        },
        {
            "value": "Много паттернов и одна строка <p>Приветствую,</p>\n<p>Есть много regex шаблонов и одна строка. Ищу разумный способ определить, какой из шаблонов совпадает со строкой.</p>\n<p>В данный момент прогоняю ст"
        },
        {
            "value": "После логина в админку редирект на /accounts/profile/ <p>Доброго дня, приключилась вот какая проблемка: при логине в админку на джанго-сайте вместо того, что бы после удачного логина перекидывать в /a"
        },
        {
            "value": "Взаимодействие с БД в Python <p>Имеет ли Python свои библиотеки для работы с СУБД (как PHP)?</p>"
        },
        {
            "value": "На чём развернуть высоко нагруженный сайт (python, MySQL)? <p>Есть работающий сайт, написанный на Python (Django), и БД - MySQL.<br>\nТак как разработчики не сильно потрудились над написанием оптимизир"
        },
        {
            "value": "Сортировка массива из 2х типов объектов <p>Добрый день, суть проблемы такова: имеются модели 2х типов - пусть будет А и В. Имеются выборки по ним, т.е.<br>\n</p>\n<pre><code>a = A.objects.filter(paramet"
        },
        {
            "value": "Нейронные сети на Python <p>Кто сталкивался? Какие библиотеки посоветуете? Есть ли примеры работы у кого-нибудь?</p>\n"
        },
        {
            "value": "Как поставить Python на Android <p>Бесплатных вариантов не нашёл. Есть ли вообще такое? Если есть, то нормально ли работает?</p>"
        },
        {
            "value": "Предварительно выбранный автор в админке Django <p>Имеется вот такая модель:</p>\n<pre><code>class NewsContent(models.Model):\n    title = models.CharField(_('Title'), max_length=255)\n    author = model"
        },
        {
            "value": "Как убрать админку на сторонний app (Django admin) <p>Скорее всего вопрос легкий, просто не знаю, как прогуглить. Есть пакеты, которые лежат в site-packages питона или же самой <a href=\"https://www.dj"
        },
        {
            "value": "Кеширование в Django <p>Не получается закешировать данные.<br>\nДелаю так (<strong>ctype.id=158</strong>, <strong>objects=[данные в QuerySet формате]</strong>):\n</p><pre><code>from django.core.cache im"
        },
        {
            "value": "Разница списков в Python <p>Имеется три списка: <code>список1</code>, <code>список2</code> и <code>список3</code>. </p>\n\n<p>Известно, что <code>список1 &gt; список2</code> (по количеству элементов), а"
        },
        {
            "value": "Как избавиться от ошибки ValueError в Python? <p>При вводе пустого или буквенного значения в строке <code>float(raw_input())</code> возвращается ошибка <code>ValueError</code>; что нужно сделать, чтоб"
        },
        {
            "value": "Django ulrs регулярное выражение <p>Подскажите как добавить в url слово, чтобы оно не шло в параметр\nесть такая строчка<br>\n</p>\n<pre><code>url(r'^(?P&lt;country&gt;[A-Za-z0-9_-]+)/(?P&lt;slug&gt;[A-Z"
        },
        {
            "value": "Обучение PyQt4, какие есть основные функции Qt4 <p>Обучение программированию без какой либо документации практически невозможно. Я только начинаю изучать язык и без подробного описания, это дается тру"
        },
        {
            "value": "Движки для интернет-магазина <p>Не подскажете, какие существуют бесплатные движки для построения интернет магазина? Интересует не хостинг, а именно исходники. Желательно на Python.</p>"
        },
        {
            "value": "Создание бота <p>Как мне написать бота для сайта, который добавляет много людей в список друзей?</p>"
        },
        {
            "value": "Как в django сделать денежное поле в модели? <p>Варианты типа \"хранить в int и при выводе делить на 100\" просьба не предлагать. </p>"
        },
        {
            "value": "Как правильно использовать beginInsertRows и endInsertRows? <p>Здравствуйте.</p>\n<p>Есть главное окно (на нём происходит вывод из БД), при нажатии на \"добавить\" открывается новое окно с формами для за"
        },
        {
            "value": "Добавить значение в QuerySet, ручками <p>Нужно добавить значения в QuerySet модели UserQueAns. Значения id_que = 1, id_ans = 2, user_id = 252. Значения я получил с формы ручками после валидации их обр"
        },
        {
            "value": "Выход из условия <p>Имеется код, выполняющий набор функций (в моем самоучительном варианте это система регистрации аккаунтов и администрирование их). Для выбора нужного действия я ввожу цифру и т.д. М"
        },
        {
            "value": "Смысл фразы \"Инструкция присваивания создаёт ссылку на объект\" <p>Сейчас изучаю python по книжке Марка Лутца. И там в главе 11 рассматривается инструкция присваивания. И у меня возникла некоторые непо"
        },
        {
            "value": "py2exe и иже с ним подобные для python3 <p>Столкнулся с проблемой, что для третьей версии питона нет необходимой мне сейчас утилиты py2exe. Кто может подсказать аналоги? Ну и желательно краткую докуме"
        }
    ]
}